Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh543-v2.tmx
Source language: bo
Languages: en

source: རྒྱལ་བས་གསུངས་པའི་སྔགས་ཀྱིས་ནི། །ཞི་བའི་ལས་ནི་བྱ་བ་ཡིན། །
en: “One should perform rites of pacifying Using the mantras taught by the victorious ones.

source: རིན་ཆེན་རིགས་ཀྱི་བྱ་བ་ནི། །རྒྱས་པའི་ལས་ནི་ཐམས་ཅད་དོ། །
en: For all the rites of nourishing, One should use the mantras of the Jewel family. {33.41}

source: གང་དག་སྡིག་པའི་ལས་རྣམས་ཀུན། །མངོན་སྤྱོད་ལ་ནི་རབ་ཏུ་སྦྱར། །
en: “All evil rites are employed In the activities of assault.

source: མངོན་པར་སྤྱོད་པའི་ལས་རྣམས་ནི། །རྡོ་རྗེའི་རིགས་ཀྱིས་བྱ་བ་ཡིན། །
en: All rites of assault should be performed Using the mantras of the Vajra family.

source: འཇིག་རྟེན་མགོན་གྱིས་བཀག་ན་ཡང་། །གནོད་སྦྱིན་དབང་ལ་རབ་ཏུ་བསྟན། །
en: Though forbidden by the lords of the world, Such mantras have been taught by the lord of yakṣa s. {33.42}

source: སེམས་ཅན་རྣམས་ནི་གདུལ་བའི་ཕྱིར། །སྔགས་ཀྱི་ཆེ་བའི་བདག་ཉིད་གསུངས། །
en: “The mantras, in all their greatness, Manifest in order to guide sentient beings.

source: རིགས་གསུམ་ཉིད་ཀྱིས་ཐམས་ཅད་དུ། །རྣམ་པ་གསུམ་དུ་བསྟན་པ་ཡིན། །
en: They are said to be of three types, Always belonging to [one of] the three families. {33.43}

source: ཐུབ་པ་ཉིད་ཀྱིས་རིགས་དག་ནི། །གང་ཡང་བརྒྱད་དུ་ཡང་དག་བསྟན། །
en: “As for the eight families Enumerated by the Sage himself,

source: གྲུབ་པ་དེ་དག་རྣམ་གསུམ་འགྱུར། །རྣམ་པ་གསུམ་དུ་ཡང་དག་བསྟན། །
en: The accomplishment in them is threefold, As it arises in three different ways—

source: མཆོག་དང་བར་མ་ཐ་མ་ནི། །
en: Supreme, middling, or inferior.

source: དེ་དག་རྣམ་པ་གསུམ་འབྱེད་པ། །
en: This is its threefold division. {33.44}

source: ཞི་དང་རྒྱས་པ་དག་དང་ནི། །མངོན་སྤྱོད་པར་ནི་འདོད་པ་ཡིན། །
en: “It can be of a peaceful, Nourishing, or cruel type.

source: སྔགས་དང་ལྡན་པ་ཉིད་དག་དང་། །རྒྱུད་དང་ལྡན་པ་ཁོ་ནར་བསྟན། །
en: This is taught exclusively In the context of mantra and tantra. {33.45}

source: སྔགས་ཀྱི་འགྲོ་བའི་བདག་ཉིད་ཆེ། །མངོན་པར་སྤྱོད་ལ་སྦྱར་བ་ཡིན། །འདི་དག་ལས་ནི་མི་འདོད་དེ། །ཐུབ་པ་མཆོག་གིས་སྨད་པ་ཡིན། །
en: “When the exalted function of mantras Is utilized in the activity of assault, Such rites are debased And condemned by all the omniscient ones. {33.46}

source: ཤིན་ཏུ་ཉམ་ངར་གྱུར་ཀྱང་ནི། །སྲོག་ལ་གནོད་ལས་མི་བྱའོ། །
en: “Even when one is in trouble, one must not perform Any rite that interrupts the life force [of the target].

source: མདོར་བསྡུ་ན་ནི་མ་འདྲེས་པར། །ལས་ཀྱི་བདག་ཉིད་ཆེན་པོར་བསྟན། །
en: The magnitude of the karma incurred Is described here only briefly: {33.47}

source: དེར་ནི་རིགས་དང་ཆོ་ག་སྔགས། །ལས་ནི་རྒྱ་ཆེ་རྒྱ་ཆེ་བ། །
en: “The karmic consequences of mantras Employed in tantric procedures are far reaching and extensive.

source: ཆོ་གའི་རྒྱལ་པོ་འདི་ལ་གསུངས། །རྒྱུད་གཞན་དག་ལའང་སྣང་བ་ཡིན། །
en: This has been taught in this king of manuals And can also be found in other tantras. {33.48}

source: ལས་ཉམས་རྣམས་ནི་མི་བསྟེན་ཅིང་། །སྔགས་རྣམས་ཀུན་ལ་རིགས་པར་ལྡན། །
en: “Although one may be able to use any mantra, One should not perform inferior rites.

source: འཇིག་རྟེན་སྔགས་རྣམས་ཇི་སྙེད་པ། །དེ་བཞིན་ཆ་བཅས་ཆ་མེད་པའོ། །
en: Whatever worldly mantras there are, They are all of dubious benefit. {33.49}

source: འཇིག་རྟེན་འདས་པ་ཐམས་ཅད་ཀྱང་། །འདི་འདྲའི་ཡོན་ཏན་ཤེས་པར་བྱ། །
en: “All the supramundane mantras, on the other hand, Are always endowed with good qualities.

source: སྔགས་གྲུབ་གྲངས་ནི་མེད་གྱུར་ཀྱང་། །དེ་གྲངས་ཡོངས་སུ་བརྗོད་པར་བྱ། །
en: The mantra accomplishments are infinite, As they are proclaimed to be. {33.50}

source: དང་པོ་གྲངས་གཅིག་འབྱུང་བ་སྟེ། །དེ་བཞིན་ཉི་ཤུའང་ལྡན་པར་འབྱུང་། །
en: “The count begins from one, But, similarly, twenty are described.

source: དེ་ནས་མདོར་ན་སུམ་ཅུ་སྟེ། །དེ་ལས་གཞན་ཡང་བཞི་བཅུ་ཡིན། །
en: Then thirty, if put briefly, And after that, forty. {33.51}

source: དེ་ཕྱེད་བསྣན་ན་དྲུག་ཅུ་སྟེ། །དེ་བཞིན་བཅུས་བསྣན་བདུན་ཅུ་ཡིན། །
en: “Next is sixty—[a number] divisible by three. With an extra ten, it becomes seventy.

source: དེ་སྟེང་བཅུས་ནི་བསྣན་པ་ལ། །བརྒྱད་ཅུའི་གྲངས་སུ་གསུངས་པ་ཡིན། །
en: If another ten is added, The number, they say, is eighty. {33.52}

source: དེ་ལ་བཅུས་བསྣན་དགུ་བཅུར་གསུངས། །
en: “If another ten is added, the number is called ninety,

source: བཅུ་གཞན་གྱིས་བསྣན་བརྒྱ་ཡིན་ཏེ། །
en: And with another ten, it is a full one hundred.

source: བརྒྱ་ཡི་གྲངས་ཀྱིས་བགྲང་བ་ཡི། །དེ་དག་བཅུ་ལ་སྟོང་ཕྲག་གཅིག །
en: One hundred now being the base for counting, Ten of these makes one thousand. {33.53}

source: སྟོང་ཕྲག་བཅུ་ལ་ཁྲི་ཡིན་ཏེ། །ཁྲི་བཅུ་ལ་ནི་འབུམ་ཕྲག་གཅིག །འབུམ་ཕྲག་བཅུ་ལ་ས་ཡ་སྟེ། །ས་ཡ་བཅུ་ལ་བྱེ་བ་ཡིན། །བྱེ་བ་བཅུ་ལ་དུང་ཕྱུར་སྟེ། །དུང་ཕྱུར་བཅུ་ལ་ཐེར་འབུམ་ཡིན། །དེ་བཅུ་ཐེར་འབུམ་ཆེན་པོར་བསྟན། །དེ་བཅུ་ལ་ནི་ཤུ་རྡོག་སྟེ། །ཤུ་རྡོག་བཅུ་ལ་མཆོག་ཉལ་ཡིན། །མཆོག་ཉལ་བཅུ་ལ་རྐྱང་ཕྱེ་སྟེ། །རྐྱང་ཕྱེ་ཆེན་པོ་དེ་བཅུ་ཡིན། །དེ་བཅུ་ལ་ནི་ཁྱད་ཕྱིན་ཡིན། །ཁྱད་ཕྱིན་ཆེན་པོ་དེ་བཅུ་ཡིན། །དེ་དག་བཅུ་ལ་སྒྱུ་མར་བརྗོད། །སྒྱུ་མ་ཆེན་པོ་དེ་བཅུ་ཡིན། །དེ་བཅུ་ལ་ནི་མཚོ་ཡས་ཞེས། །འཇིག་རྟེན་འདྲེན་པས་གསུངས་པ་ཡིན། །མཚོ་ཡས་ཆེན་པོ་དེ་དག་བཅུ། །མཚོ་ཡས་ཆེན་པོ་དེ་བཅུ་ལ། །དུག་ཆེན་པ་ཡི་རྒྱ་མཚོ་ཡིན། །དེ་དག་ཉི་ཤུའི་ཕྱེད་ལ་ནི། །དུག་ཆེན་རྒྱ་མཚོ་ཆེན་པོ་ཡིན། །དུག་ཆེན་རྒྱ་མཚོ་བཅུ་ལ་ནི། །མཆོག་ཡས་ཞེས་ནི་བརྗོད་པ་ཡིན། །མཆོག་ཡས་བཅུ་ཞེས་བསྟན་པ་ནི། །བན་བུན་དག་ཏུ་རབ་ཏུ་བསྟན། །བན་བུན་དེ་དག་བཅུ་ལ་ནི། །དེ་ནི་མ་ལུས་པ་ཞེས་བརྗོད། །
en: “Ten thousands is one ayuta; Ten ayutas is one lakh. Ten lakhs is one vilakh (one million), And ten of these is one koṭi (ten million). {33.54} “Ten koṭis is one vikoṭi (one hundred million), And ten of the latter is one arbuda (one billion). Ten arbuda s is one nirbuda (ten billion), And ten of these is, as expected, one khaḍga (one hundred billion). {33.55} “Ten khaḍga s is one nikhaḍga (one trillion), And ten nikhaḍgas is, as expected, one kharva (ten trillion). Ten kharvas is one padma (one hundred trillion), And ten padmas is one mahāpadma (one quadrillion). {33.56} “Ten mahāpadma s is one vāha (ten quadrillion); Ten of these is one vivāha (one hundred quadrillion). The next after that is known as mahāvivāha (one quintillion), And ten of these is called māya (ten quintillion). {33.57} “Ten māyas is one mahāmāya (one hundred quintillion); Mahāmāya, after another multiplication by ten, Is termed by the guides of the world samudrā (one sextillion), As [known] in the science of algebra. {33.58} “The next number, after the multiplication By the ‘half of twenty,’ is mahāsamudrā (ten sextillion); Mahāsamudrā, when multiplied by ten, Is called sāgara (one hundred sextillion). {33.59} “When multiplied by the ‘half of twenty,’ It becomes mahāsāgara (one septillion); The latter, multiplied by ten, Is called pragharā (ten septillion). {33.60} “Ten pragharās, as they are called, Are proclaimed to be one gharā (one hundred septillion); Ten of the so-called gharās Are said to be one aśeṣa (one octillion). {33.61}

source: དེ་དག་ཉི་ཤུ་ཕྱེད་ལ་ནི། །མ་ལུས་ཆེན་པོ་ཞེས་སུ་བརྗོད། །
en: “Aśeṣa, multiplied by the ‘half of twenty,’ Becomes mahāśeṣa (ten octillion).

source: དེ་ཚེ་གྲངས་ཀྱི་ཚད་དུ་ནི། །འཇིག་རྟེན་འདྲེན་པས་གསུངས་པ་ཡིན། །
en: This, according to the guides of the world, Is the limit beyond which a number is incomputable. {33.62}

source: བཅུ་ཡི་གྲངས་ཀྱིས་བཅུར་བྱས་ན། །གྲངས་ནི་གྲངས་མེད་ཅེས་སུ་བརྗོད། །
en: “Counting is said to rely on multiplying by ten, But then, it is an incomputable number that is multiplied.

source: གྲངས་མེད་བཅུར་ནི་བསྒྱུར་བྱས་ན། །དེ་ལས་གཞན་དུ་དཔག་མེད་ཡིན། །
en: Multiplying an incomputable number by ten Gives a number even more incomputable. {33.63}

source: དཔག་མེད་སྟོང་དུ་བསྒྱུར་བྱས་ན། །འཇིག་རྟེན་ཞེས་ནི་ཡོངས་སུ་བསྟན། །
en: “ This world is proclaimed to be multiplied A thousandfold infinite number of times.

source: འཇིག་རྟེན་དེ་བཅུ་འཇིག་རྟེན་ཆེ། །འཇིག་རྟེན་ཆེན་པོ་བསྒྲེས་བྱས་ན། །
en: The cosmic unit next to this world Is a great world , which is manifolded further. {33.64}

source: དེ་འོག་མུན་པ་ཞེས་སུ་བརྗོད། །མུན་པ་ལས་ནི་སྣང་བར་བརྗོད། །
en: “Beyond that, there is the so-called darkness, And beyond that, the so-called light.

source: སྣང་བ་ཆེན་པོ་དེ་དག་བཅུ། །དེ་བཅུ་ལ་ནི་ཕུང་པོར་བརྗོད། །
en: After light is the so-called great light, And when this is multiplied, it is called multitude. {33.65}

source: ཕུང་པོ་དེ་བཅུ་བསྒྲེས་ན་ནི། །ཕུང་པོ་ཆེན་པོར་དེ་བརྗོད་དོ། །
en: “After the multitude is the so-called great multitude,

source: ཕུང་པོ་ཆེན་པོ་དེ་བཅུ་ལ། །འདི་ནི་ཟབ་པ་ཞེས་བརྗོད་དོ། །
en: And after the great multitude is one called the deep.

source: ཟབ་པ་ལས་ནི་བརྟན་པར་བརྗོད། །
en: After the deep is one called the stable,

source: བརྟན་པ་ལ་ནི་རབ་བརྟན་འགྲོ། །
en: And after the stable comes the more stable. {33.66}

source: དེ་ནས་གོང་དུ་མང་ལྡན་ཡིན། །མང་པོར་འདོད་པ་གནས་སུ་བརྗོད། །
en: “Beyond that is the abundant, And beyond the abundant , the basis.

source: རྩིས་ཤེས་དམ་པས་གནས་སུ་བརྗོད། །དེ་ནས་གནས་ནི་ཆེན་པོར་འགྲོ། །
en: According to those who delight in the art of enumeration, Beyond the basis is the more basic. {33.67}

source: ཆེན་པོའི་གནས་ཞེས་འདོད་པ་ཡིན། །དཔག་དང་དཔག་མེད་མཉམ་བྱས་ནས། །དེ་དོན་ཆེན་པོར་ཡོངས་སུ་བསྒྲགས། །དོན་ཆེན་རབ་འབྱོར་གནས་དང་ནི། །དེ་ནས་རྒྱ་མཚོ་ཆེན་པོར་འགྲོ། །
en: “After that comes the great basis, And the one after the great basis is known as the fixed. When we have moved from the fixed to the more fixed, The next [on the list] is known as the great thing. {33.68} “After the great thing there is the famous basis, And after that comes the great ocean.

source: དང་པོ་རྒྱ་མཚོ་ཆེན་པོར་བསྟན། །དང་པོའི་དང་པོར་ཕན་པ་དང་། །
en: After the great ocean is one called the primal, And after the primal is the more primal. {33.69}

source: དང་པོ་མཆོག་ཅེས་བྱ་བར་བསྟན། །མཆོག་ལས་གཙོ་བོར་བརྗོད་པ་སྟེ། །
en: “The one after the [more] primal is called excellent, And the one after the excellent , the most excellent.

source: གཙོ་ལས་ཁྱིམ་གྱི་མིང་ཡིན་ནོ། །དེ་ནི་བསམ་མི་ཁྱབ་པར་བརྗོད། །
en: After the [most] excellent is one called dwelling place, And after the dwelling place , one known as the inconceivable. {33.70}

source: བསམ་མི་ཁྱབ་ལས་མི་བཟད་གཟུགས། །མི་བཟད་གཟུགས་ལས་རྒྱལ་ཐབས་འདོད། །
en: “[After] the inconceivable there is the terrible; [After that,] the terrible , the kingdom.

source: རྒྱལ་ཐབས་ལས་གཞན་གཏེར་ཡིན་ཏེ། །དེ་ཡི་འོག་མ་དགེ་བ་ཡིན། །
en: Beyond the kingdom is the home of the treasure, And beyond that is the virtuous. {33.71}

source: དགེ་བའི་ཕ་རོལ་སེམས་ལས་བྱུང་། །དེ་ལས་གཞན་པ་སེམས་བྱུང་ཆེ། །
en: “Beyond the virtuous is the great mind, And the next after that is the no-mind.

source: སེམས་ལས་སེམས་ནི་རྣམ་པར་གཡེང་། །བརྗོད་པ་ཞེས་ནི་དེ་ལ་བྱ། །
en: After the no-mind is the confused mind, And after that is what is called expressible. {33.72}

source: བརྗོད་པ་ལས་ནི་བརྗོད་མེད་ནས། །བསྙད་ཡས་སུ་ཡང་བརྗོད་པ་ཡིན། །བསྙད་ཡས་ལས་གཞན་བསྙད་ཡས་ཆེ། །
en: “After the expressible is the inexpressible. Next is one called the universal, And after the universal is the great universal.

source: དེ་ཚེ་ཕྱར་ཕྱུར་ཞེས་ཀྱང་བརྗོད། །
en: Next is one called asvara. {33.73}

source: ཕྱར་ཕྱུར་ལས་ནི་ཕྱར་ཕྱུར་ཆེ། །
en: “After the asvara is the place of the great asvara,

source: ཤུ་རྡོག་དེ་བཞིན་ཤུ་རྡོག་ཆེ། །
en: After which there is the kharva.

source: རྩིས་ཀྱི་ཕ་རོལ་ཕྱིན་པའི་གནས། །དགེ་ཞིང་ཞི་བ་ཞེས་སུ་བསྟན། །
en: The place auspicious peace is so called By those who have reached the limit of enumeration. {33.74}

source: དེ་ནས་བགེགས་ཆེན་མཐོང་བ་སྟེ། །
en: “After the very courageous is the courageous,

source: ཆུ་འབྱུང་ཞེས་ནི་དེ་ལས་བརྗོད། །
en: And then one called the watery.

source: ཆུ་འབྱུང་དེ་ལས་སེམས་འཕྲུལ་ནས། །
en: After the watery is the confused mind,

source: དེ་ལས་གཞན་པ་དམ་པ་ཡིན། །དེ་ལས་ཕ་རོལ་སངས་རྒྱས་ཡུལ། །དེ་ལས་གཞན་ནི་འཕེལ་བྱེད་ས། །
en: And after that, another place [called] the ultimate. {33.75} “Beyond the ultimate is the domain of the buddhas, With its superior levels.

source: འཇིག་རྟེན་མི་ཡི་རྩིས་དག་ནི། །བགྲང་བར་ཡང་ནི་མི་ནུས་སོ། །
en: It is impossible for human beings to Go over all these world divisions. {33.76}

source: དེ་ལས་གཞན་དུ་སངས་རྒྱས་ཀྱི། །གོ་འཕང་དང་ནི་སྤྱོད་ཡུལ་ཡིན། །
en: “There is nothing that would be regarded As superior to the domain of the buddhas.

source: སངས་རྒྱས་ཞིང་ནི་གང་གཱའི་ཀླུང་། །བྱེ་མ་སྙེད་དུ་བརྗོད་པ་ནི། །
en: Buddhafields are believed To be as numerous as the grains of sand in the Gaṅgā. {33.77}

source: བསྡུས་ནས་རྡུལ་གྱི་ཚོགས་དག་ནི། །འདྲེན་པས་བསྟན་པ་མཛད་པ་ཡིན། །
en: “Dissecting [the physical matter,] The guides [also] taught about the smallest particles.

source: འདི་དག་དཔེར་ནི་བྱས་པ་སྟེ། །ཚད་མ་ཤེས་པའི་སྤྱོད་ཡུལ་མིན། །
en: This was done by way of examples [Within] the domain of analytical investigation.

source: རྒྱུ་ཡིས་དངོས་པོ་བསྒྲུབ་བྱ་སྟེ། །
en: Physical matter can be established through logic ( hetunā );

source: རྩིས་ཀྱི་ཕ་རོལ་ཕྱིན་མི་ནུས། །
en: It cannot be established by relying [solely] on enumeration. {33.78}

source: འདི་ཙམ་རྫོགས་པའི་སངས་རྒྱས་ལ། །སྔོན་ནི་ང་ཡིས་བསྙེན་བཀུར་བྱས། །
en: “In the past, I served fully realized buddhas Whose number matched such enumeration.

source: དཔག་མེད་བསྐལ་པ་དག་ཏུ་ནི། །དེ་དག་ལ་ནི་མཉེས་བྱས་ནས། །
en: I worshiped them During this inconceivable eon.

source: དེ་ཙམ་དུས་ཀྱི་མཐར་ཐུག་པར། །ང་ནི་བྱང་ཆུབ་སེམས་དཔར་གྱུར། །
en: In the infinity of time, I became a bodhisattva long ago. {33.79}

source: སེམས་ཅན་དོན་ནི་བསྒྲུབ་བྱའི་ཕྱིར། །སངས་རྒྱས་ཉིད་དུའང་ཡང་དག་བསྟན། །
en: “For the sake of beings, I became fully realized and attained buddhahood.

source: དེ་དང་དེར་ནི་བདག་གི་སྔགས། །ཆོ་ག་རྒྱ་ཆེན་བསྟན་པ་ཡིན། །
en: I taught tantra in different places, Providing full details of the rituals. {33.80}

source: ཆོ་ག་ཡི་ནི་རབ་མཆོག་འདི། །སངས་རྒྱས་འདི་དག་ཀུན་གྱིས་གསུངས། །
en: “Taught by the buddhas, This supreme [manual of] rites is the best.

source: འདི་ཙམ་ཚད་ཀྱི་སངས་རྒྱས་ཀྱིས། །སྔོན་ཆད་འདི་ནི་གསུངས་པ་ཡིན། །
en: It was taught to me in the past By so many fully realized buddhas. {33.81}

source: དུས་ཀྱི་ཐ་མའི་སྐྱེ་བོ་ལ། །གཞོན་ནུ་ང་ཡང་ང་ཡིས་བསྟན། །
en: “And now, O divine youth, I teach it myself During my final embodied existence.

source: ཇི་སྙེད་འཇིག་རྟེན་སྔགས་རྣམས་དང་། །ཆོ་གའི་རྒྱལ་པོའི་སྣོད་དང་ནི། །དེ་བཞིན་འཇིག་རྟེན་འདས་པ་དང་། །མི་དང་ལྷ་དང་ལྷ་མིན་དང་། །ཐམས་ཅད་ཀུན་གྱི་སྔགས་རྣམས་ནི། །རྒྱུད་དང་རིགས་པར་རབ་ཏུ་བསྟན། །
en: However many worldly mantras And auspicious kings of rites there are, {33.82} “However many supramundane or divine mantras there are Among men , gods, and asuras, I have explained tantric applications For all of them. {33.83}

source: ཆོ་གའི་རྒྱལ་པོ་རྫུ་འཕྲུལ་ཆེ། །
en: “This king of manuals, celebrated everywhere, Has great magical power.

source: གང་དུ་ཀུན་གྱིས་ཡོངས་སུ་བཀུར། །དེ་དག་ཆོ་ག་ཞིབ་མོ་ཡིས། །འཇམ་པའི་ངག་ནི་འགྲུབ་པར་འགྱུར། །
en: By applying the ritual procedures of the mantras One will attain accomplishment and become like Mañjughoṣa. {33.84}

source: འཇམ་པའི་དབྱངས་ཀྱི་ཆོ་ག་ནི། །འདི་ཉིད་ཀྱི་ནི་ཞིབ་མོ་ཞེས། །དེ་དག་འགྲུབ་པར་གསུངས་པ་སྟེ། །ཐམས་ཅད་ཀུན་པས་མཐུ་ལྡན་འགྱུར། །
en: “It has been declared by Mañjughoṣa, The powerful lord, that by the sole means of This manual with its procedures All these [mantras] will be accomplished. {33.85}

source: གང་ཡང་མི་ཡི་འཇིག་རྟེན་དང་། །གང་གཞན་སྔགས་ཀྱི་ལྷ་མོ་དང་། །འཇིག་རྟེན་འདས་པའི་སྔགས་ཀུན་དང་། །འཇིག་རྟེན་རྫུ་འཕྲུལ་ཆེ་དང་བཅས། །
en: “It is a foregone conclusion that Whatever other deity mantras there are— All the supramundane And mundane ones of great power— {33.86}

source: འདི་ཉིད་ཚུལ་གྱི་ཆོ་ག་ཡིས། །ཆོ་གའི་རྒྱལ་པོས་འགྲུབ་པ་ཉིད། །
en: “They too can become accomplished By the ritual methods in this king of manuals.

source: སྔགས་རྣམས་ཀུན་དང་ཆོ་ག་ཀུན། །འདི་ཡི་དབང་དུ་འགྱུར་བར་བསྟན། །ཆོ་གའི་རྒྱལ་པོ་བླ་མེད་འདི། །གང་དུ་འཇམ་དཔལ་གྱིས་རབ་བཞེད། །
en: Mañjuśrī controls all the mantras In all the rites that have been taught— He is thus acclaimed In this supreme king of manuals. {33.87}

source: གང་ཡང་བཟོ་ནི་རྣམ་པར་ཤེས། །འཇིག་རྟེན་པ་ཡི་འཇིག་རྟེན་འདོད། །རྒྱུ་མཚན་ཤེས་དང་ལ་ཉེ་བཟང་། །སྐར་མའི་དཔྱད་ཀྱི་རྟགས་དང་ནི། །
en: “Whatever practical skills and branches of knowledge Are recognized in the world, Such as the omens taught in the art of prognostication And interpreted based on the knowledge of astrology;

source: རྒྱུ་མཚན་ཤེས་དང་སྤྱོད་པ་དང་། །སྒྲ་སྐད་དགེ་དང་མི་དགེ་དང་། །
en: Whatever types of behavior are taught in the art of prognostication, Or auspicious and inauspicious sounds;

source: འབྱུང་པོ་ཀུན་གྱི་སྐད་ཤེས་དང་། །སྤྱོད་དང་སེམས་ཀྱི་སྤྱོད་པ་དང་། །ཟུར་གྱིས་ཤེས་པ་དག་ཀྱང་བཤད། །
en: {33.88} “Whatever voices there are of whatever creatures That betoken their thoughts and behavior; Whatever elements, sense bases, substances, . . . . . . . . . . . . . . . . . .; {33.89}

source: དེ་བཞིན་གཏེར་ལྟ་ནོར་སྒྱུར་བྱེད། །རྩིས་དང་བརྡ་སྤྲོད་བསྟན་བཅོས་དང་། །གོས་ཀྱི་རིམ་པའི་ཆོ་ག་དང་། །
en: “Whatever so-called portents or signs, Techniques ( kriyā ) of mining minerals, Algebra, grammar, sciences, Armaments, and ritual procedures; {33.90}

source: ནང་རིག་གསོ་བ་རིག་པ་དང་། །དེ་ཉིད་ཐམས་ཅད་ཕན་དང་བདེ། །
en: “Whatever knowledge of one’s inner being, medicine, And the welfare and happiness of all beings;

source: གཏན་ཚིགས་ལུགས་ཀྱི་བསྟན་བཅོས་དང་། །གཞན་ཡང་སྒྲ་ཡི་བསྟན་བཅོས་བསྟན། །
en: Whatever art of logical argument ( hetunīti ) and other skills; Whatever established science of linguistics; {33.91}

source: སྡེབ་སྦྱོར་རིག་བྱེད་དྲི་ཟའི་གླུ། །སྤོས་སྦྱོར་དག་ཀྱང་བསྟན་པ་ཡིན། །
en: “And whatever prosody, music, and the art of making perfumes there are— Whatever of these have been enumerated,

source: བདག་གིས་བྱང་ཆུབ་སེམས་ཀྱིས་ནི། །སེམས་ཅན་དོན་ཕྱིར་བཤད་པ་ཡིན། །
en: I, the bodhisattva, have taught them In order to benefit sentient beings. {33.92}

source: བདག་ནི་བྱང་ཆུབ་སེམས་སྔོན་གྱུར། །འཁོར་བའི་རྒྱ་མཚོར་སྔར་གནས་ཚེ། །སེམས་ཅན་རྣམས་ལ་ཕན་པའི་ཕྱིར། །བདག་གིས་སུ་ནི་བཤད་པ་ཡིན། །
en: “In former times, I, the bodhisattva, Knowing that they benefit beings, Taught them to the inhabitants Of the ocean of saṃsāra. {33.93}

source: འཁོར་བའི་དགོན་པའི་ཚང་ཚིང་དུ། །བདག་ནི་ཡུན་རིང་དུས་སུ་གནས། །ཇི་ལྟར་གདུལ་བྱའི་སེམས་ཅན་ལ། །དེ་ལྟར་བདག་གིས་དེ་བཞིན་བྱས། །
en: “Living for a long time In the dense forests of saṃsāra, I act in the way that Brings beings to maturity. {33.94}

source: ཇི་ལྟ་ཇི་ལྟར་སེམས་ཅན་རྣམས། །ཕན་པའི་ལས་ནི་ལེན་པ་དག །ཕན་དོན་ལས་ཀྱིས་དགེ་བའི་གཞི། །དེ་ལྟ་དེ་ལྟར་འདི་དག་བྱས། །
en: “I work for the benefit of beings, Creating for them stores of merit In every way that good karma Can be accumulated. {33.95}

source: སྣ་ཚོགས་ལས་ཀྱིས་བསྒྱུར་བ་ཡི། །སེམས་ཅན་འགྲོ་བའི་སྐྱེ་གནས་དག །
en: “Established in various activities, Beings obtain [corresponding] types of birth.

source: འདི་དག་བྱ་བ་སྣ་ཚོགས་བྱས། །སྣ་ཚོགས་སྐྱེ་གནས་རབ་ཏུ་བསྟན། །
en: I perform various activities For those limited by birth who have various needs. {33.96}

source: ལས་རྣམས་སྣ་ཚོགས་ལྡན་པ་ཡིས། །སྣ་ཚོགས་དོན་གྱི་བསྟན་བཅོས་བསྟན། །
en: “Beings engage in various activities, Serving the different aims described in the śāstras.

source: རྣམ་པ་སྣ་ཚོགས་གཟུགས་ལྡན་པས། །འདི་ལ་དེ་བཞིན་བྱས་པ་ཡིན། །
en: I fulfill these [aims] for them, Assuming various excellent forms. {33.97}

source: སྣ་ཚོགས་འགྲོ་བའི་སྐྱེ་གནས་སུ། །བདག་གིས་དེ་བཞིན་ཆ་བྱད་བྱས། །
en: “I thus assume different guises, Using different bodies, be they my own or not.

source: ཕན་པའི་བསམ་པས་སེམས་ཅན་ལ། །སྣ་ཚོགས་གཟུགས་ནི་བདག་གིས་སྤྲུལ། །
en: Motivated by [the wish] to benefit beings, I created different forms. {33.98}

source: དབང་ཕྱུག་བརྒྱ་བྱིན་ཚངས་པ་སོགས། །ཁྱབ་འཇུག་ནོར་སྦྱིན་བདེན་བྲལ་དང་། །སྣ་ཚོགས་གཟའ་ཡི་གཟུགས་སོགས་ཀྱང་། །དེ་ཚེ་སྔོན་ནི་ང་ཡིས་སྤྲུལ། །
en: “I created, in the past, [the forms of] Maheśvara, Śakra, Brahmā, and others; Viṣṇu, Dhanada, and Nairṛta; And also the different forms of the grahas. {33.99}

source: ཐུགས་རྗེ་ཆེན་པོའི་དབང་གྱུར་ཐུགས། །སེམས་ཅན་བསམ་པའི་སྤྱོད་ཡུལ་ཅན། །
en: “With their minds full of great compassion, They are objects of refuge for beings.

source: དེ་དག་ལ་ནི་རིམ་གྱིས་སུ། །ཞི་བའི་གནས་ལ་བཞག་པ་ཡིན། །
en: Gradually, I establish these beings In a state of peace. {33.100}

source: འཁོར་བར་ཕན་ཚུན་འགྲོ་བ་ན། །ཡུན་རིང་དུས་སུ་ཐོགས་པ་ནི། །
en: “I wander throughout saṃsāra, Observing beings over long periods of time.

source: སེམས་ཅན་རྣམས་ཀྱི་དོན་བསྒྲུབ་ཕྱིར། །སྔགས་ཀྱི་ཚུལ་གྱིས་བསྟན་པ་ཡིན། །
en: Being of the nature of the mantra, I bring the fulfillment of their needs. {33.101}

source: ཡུན་རིང་འཁོར་བའི་སྐྱེ་བར་ངས། །སངས་རྒྱས་རིགས་ལ་བརྟེན་ནས་ནི། །ཡེ་ཤེས་སྔགས་དང་ཆོ་ག་ནི། །མཐར་གྱིས་བསྟན་པར་བྱས་པ་ཡིན། །
en: “While wandering from birth to birth, I propagate, relying in the lineage of the Buddha, Mantric rituals that represent The gradual knowledge of the mantras. {33.102}

source: བྱེད་པ་དང་ནི་བདག་པོའང་རུང་། །ང་ལ་གང་ཡང་ཡོད་མིན་ཏེ། །
en: “For me, there is neither a creator, Nor an owner.

source: ངེས་པའི་རིགས་ལ་བརྟེན་ནས་ནི། །ང་ནི་སངས་རྒྱས་བྱང་ཆུབ་མཆོག །
en: Always relying on the lineage, I have realized the ultimate awakening. {33.103}

source: བདེ་བ་ནད་མེད་ཡང་དག་ཞི། །དྲི་མེད་མྱ་ངན་མེད་ཞི་བ། །
en: “I am at ease, un-aging, peaceful, Free from worry, pure, and benevolent.

source: ངས་ཐོབ་མྱ་ངན་འདས་ཞི་བ། །སྐྱེ་བའི་འཆིང་ལས་ང་རབ་གྲོལ། །
en: I have reached the peace of nirvāṇa And liberation from the fetters of birth. {33.104}

source: ཡང་ན་འཁོར་ལོ་རབ་བསྐོར་ཞིང་། །ཡང་དག་མཐའ་ལ་བརྟེན་ནས་ནི། །
en: “Presently, the wheel that holds fast to the ultimate reality Is made to roll on,

source: སྔགས་ཀྱི་ཚིག་ནི་རྒྱ་ཆེན་དང་། །ཆོ་ག་འདི་ནི་ང་ཡིས་བསྟན། །
en: As I teach this manual That explains mantras at length.

source: ལས་དང་ཆོ་ག་རྒྱ་ཆེ་བ། །ཟློས་པས་དོན་མེད་མི་བྱའོ། །
en: The reciter must not misuse This manual of rites in any of its details. {33.105}

source: འཇིག་རྟེན་ཇི་སྙེད་སྔགས་རྣམས་དང་། །ཆོ་ག་དག་ཀྱང་རབ་བསྟན་པ། །
en: “Whatever worldly mantras there are, Their rituals have been taught accordingly.

source: དེ་ཀུན་མཆོད་ཅིང་རི་མོར་བྱ། །དེ་དག་ལ་ནི་བརྙས་པ་སྤང་། །
en: All these [mantras] should be worshiped and honored, Without any contempt whatsoever.

source: ཆོ་ག་རྒྱ་ཆེན་དེ་དག་ཀྱང་། །དེས་ན་སྔགས་པས་བརྙས་མི་བྱ། །
en: Consequently, the practitioner of mantra Must also not disregard their [respective] rituals in any detail. {33.106}

source: རྒྱུ་མཚན་ཤེས་དང་རིག་པ་དང་། །སྐར་མའི་དཔྱད་ཤེས་སྐད་ཤེས་པ། །འདི་དག་དོན་མེད་མི་བྱ་སྟེ། །
en: “As for applying the knowledge of signs That has been taught as the science of astrology, One should not interpret these [signs] incorrectly.

source: བཀྲ་ཤིས་དོན་དུ་བསྟན་པ་ཡིན། །
en: They have been taught for good purposes, {33.107}

source: མཐོང་བའི་ཆོས་ཀྱི་དོན་དུ་ཡང་། །གྲུབ་པའི་རྫས་སོགས་སྨན་དང་ནི། །ཟང་ཟིང་བཅས་པར་མིག་སྨན་འགྲུབ། །དེ་ལས་བཀྲ་ཤིས་འགྲུབ་པ་ཡིན། །
en: “So that mundane pursuits, such as The preparation of power substances and other medicines, Or the healing [remedies] for the eyes, can succeed— They are thus described as beneficial. {33.108}

source: རབ་བསྔགས་རྒྱལ་བའི་ཚིགས་བཅད་དང་། །བདེ་ལེགས་ཚིགས་བཅད་ཀྱིས་བརྒྱན་པ། །
en: “The sayings of the victorious ones, adorned with the stanzas of benediction, Recommend the auspicious [settings].

source: རབ་བསྔགས་ཞག་ནི་བཟང་པོ་དག །ཡར་ངོ་དག་གིས་ལེགས་མཚན་པ། །
en: One should choose a day during a bright fortnight Recommended as the best and indicated by auspicious signs. {33.109}

source: གཟའ་མཆོག་དཀར་བ་དག་ལྡན་ལ། །སྔགས་སྒྲུབ་པ་ནི་བརྩམ་པར་བྱ། །
en: “With such auspicious and excellent planetary positions, One should commence the mantra practice.

source: དེ་ལ་སོགས་པའི་དགེ་དང་ལྡན། །མི་དགེ་དག་ཀྱང་སྤང་བྱ་བ། །
en: One should thus choose the auspicious [signs] And avoid the inauspicious. {33.110}

source: ང་ཉིད་ཀྱིས་ནི་སྔོན་བསྟན་ཏེ། །
en: “I myself taught these things in the past;

source: དེ་བས་ཟློས་པས་གཟུང་བར་བྱ། །
en: The mantra reciters should therefore accept them [as true].

source: འཇིག་རྟེན་ཇི་སྙེད་གང་སུ་དག །སྐར་མའི་དཔྱད་ལ་མཁས་པ་དང་། །
en: Whatever benefits there are in this world That can be derived from the knowledge of astrology, {33.111}

source: གཞན་གྱི་རྒྱུད་ལ་མཁས་པ་དང་། །ལུགས་ཀྱི་བསྟན་བཅོས་གཏན་ཚིགས་བཅས། །
en: “Or other such benefits — Those derived from polity and logic

source: རིག་པའི་བསྟན་བཅོས་ལེགས་འབྲེལ་བ། །སེམས་ཅན་རྣམས་ལ་ཕན་བྱེད་གང་། །
en: Or those well conceived in the treatises of Nyāya For the benefit of beings— {33.112}

source: དེ་ཀུན་ང་ཡིས་སྔོན་གསུངས་ཏེ། །སྔགས་ཟློས་པས་ནི་གཟུང་བར་བྱ། །
en: “I have taught all of this And the mantra reciters should accept it [as true].

source: ལམ་འདི་གྲུབ་པའི་རྒྱུ་ཡིན་པར། །
en: This path is the cause of accomplishment;

source: དེ་ཉིད་གཟིགས་པས་བསྟན་པ་ཡིན། །
en: It has been shown by those who know reality. {33.113}
